app/views/invoices/_form.html.erb

SELECT `users`.* FROM `users`
---
                  <label>Usuario</label>
                  <%= f.select :user_id, Invoice.user_for_select, {}, class: "form-control" %>