app/controllers/invoices_controller.rb

SELECT `invoices`.* FROM `invoices`
SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`user_id` = 2
---
  def index
  if current_user.admin?
       @invoices = Invoice.all
        else
    @invoices = current_user.invoices.all

INSERT INTO `invoices` (`amount`, `desc`, `status`, `user_id`, `date`, `created_at`, `updated_at`) VALUES ('200', 'seguimos probando', 'pending', 2, '2016-03-22 18:15:00', '2016-03-22 18:15:34', '2016-03-22 18:15:34')
---
  def create
    if !(current_user.admin?)
        redirect_to :action => 'index'
    end
    @invoice = Invoice.new(invoice_params)

    respond_to do |format|
      if @invoice.save

UPDATE `invoices` SET `amount` = 'cq22xdecw', `desc` = 'dcecef', `updated_at` = '2016-04-13 16:56:03' WHERE `invoices`.`id` = 9
---
  def update
    if !(current_user.admin?)
        redirect_to :action => 'index'
    end
    respond_to do |format|
      if @invoice.update(invoice_params)

DELETE FROM `invoices` WHERE `invoices`.`id` = 1
---
  def destroy
    if !(current_user.admin?)
        redirect_to :action => 'index'
    end
    @invoice.destroy

SELECT  `invoices`.* FROM `invoices` WHERE `invoices`.`id` = 2 LIMIT 1
---
    def set_invoice
      @invoice = Invoice.find(params[:id])