app/controllers/operations_controller.rb

SELECT `operations`.* FROM `operations`
---
  def index
    @operations = Operation.all.paginate(:page => params[:page], :per_page => 5)

INSERT INTO `operations` (`event`, `api_version`, `account_id`, `signature`, `data`, `created_at`, `updated_at`) VALUES ('charge.created', '1', 'tk_f36092c67ea4cbc8e954aa2c', '050a83f4be6e55afb2824d117debef894e870ef6', '{\"id\"=>\"cha_78e561201c6184c928dfb9de18651bf0\", \"amount\"=>60000, \"error_code\"=>nil, \"error_message\"=>nil, \"order_id\"=>\"1\", \"description\"=>\"1\", \"paid\"=>true, \"created_at\"=>\"2016-10-06T10:05:27.100Z\", \"status\"=>\"paid\", \"commission\"=>60, \"amount_to_settle\"=>59940, \"discount\"=>0, \"metadata\"=>{\"phone\"=>nil, \"address\"=>\"gfvgfd\", \"city\"=>\"fdvdfg\", \"province\"=>nil, \"user_email\"=>\"taller.didac@gmail.com\"}, \"closed_at\"=>\"2016-10-06T10:05:30.000Z\", \"payment_date\"=>\"2016-10-06\", \"card\"=>{\"id\"=>\"car_141f9d62323cf9cc8a0e48c9d871a40d\", \"bin\"=>\"450767\", \"brand\"=>\"VISA\", \"type\"=>\"debit\", \"category\"=>\"CLASICA\", \"country_code\"=>\"ES\", \"last4\"=>\"0009\", \"expiration_year\"=>2016, \"expiration_month\"=>12, \"manually_blocked\"=>false, \"entity\"=>{\"name\"=>\"C.E.C.A.\", \"bank\"=>false, \"id\"=>\"ent_175c3c3cf61930eea53992a3a8c41b83\"}}, \"refunds\"=>nil}', '2016-10-06 10:05:31', '2016-10-06 10:05:31')
---
  def CB
      invoice_updater
      @operation = Operation.new(operation_params)

      if @operation.save

SELECT  `operations`.* FROM `operations` WHERE `operations`.`id` = 1 LIMIT 1
---
    def set_operation
      @operation = Operation.find(params[:id])