app/controllers/users_controller.rb

 def update
        respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `email` = 'pepe@quienespepeelloco.com', `encrypted_password` = '$2a$10$NNaeA.8mlsApFRKyqJrpguR3mhab6NngvCrz7AMqKWWHyDfkcqZ7C', `updated_at` = '2016-05-24 16:52:44' WHERE `users`.`id` = 4

def destroy
    if !(current_user.admin?)
        redirect_to :action => 'index'
    end
    @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 4